import {Course} from "./types.ts";

export const defaultCourses = [
    new Course("20476", "מתמטיקה בדידה", 6, ["א", "ב", "ג"]),
    new Course("20109", "אלגברה לינארית 1", 8, ["א", "ב", "ג"]),
    new Course("20229", "אלגברה לינארית 2", 7, ["א", "ב", "ג"], ["20109"]),
    new Course("20474", "חשבון אינפיניטסימלי 1", 7, ["א", "ב", "ג"]),
    new Course("20475", "חשבון אינפיניטסימלי 2", 9, ["א", "ב", "ג"], ["20474"]),
    new Course("20425", "הסתברות ומבוא לסטטיסטיקה למדעי המחשב", 4, ["א", "ב", "ג"]),
    new Course("20441", "מבוא למדעי המחשב ושפת Java", 6, ["א", "ב"]),
    new Course("20407", "מבני נתונים ומבוא לאלגוריתמים", 7, ["א", "ב"], ["20441"]),
    new Course("20417", "אלגוריתמים", 7, ["א", "ב"], ["20407"]),
    new Course("20465", "מעבדה בתכנות מערכות", 6, ["א", "ב"], ["20441"]),
    new Course("20604", "מודלים חישוביים", 3, ["א", "ב"], ["20407"]),
    new Course("20471", "ארגון המחשב", 6, ["א", "ג"], ["20441"]),
    new Course("20466", " לוגיקה למדעי המחשב", 1, ["א", "ב"], ["20476"]),
    new Course("20594", "מערכות הפעלה", 7, ["א", "ב"], ["20465", "20407"]),
    new Course("20905", "שפות תכנות", 3, ["ב"], ["20407", "20604", "20417", "20465"]),
]